// 1) რისთვის გამოიყენება ფუნქცია?
// ფუნქცია გამოიყენება კოდის მოკლედ ჩასაწერად რომელიც ასრულებს კონკრეტულ დავალებას


// 2) რა keyword გამოიყენება js ში ფუნქციის შესაქმნელად
// function

// 3) შექმენი ფუნქცია რომელსაც გადაეცემა ორი არგუმენტი და ფუნქციამ უნდა დაბეჭდოს მათი ჯამი
function sum(a,b) {
    console.log(a + b)
}
sum(3,4)

// 4) რას აკეთებს return?
// abrunebs pasuxs
// 5) შექმენით ფუნქცია რომელიც დააბრუნებს return ის საშუალებით ან true ან false ს. 
function test(num) { 
    return num > 100 
}
console.log(test(20))




// მას უნდა გადაეცემოდეს ერთი რიცხვი და თუ ის მეტი ათზე, მაშინ დააბრუნდეთ true, სხვა შემთხვევაში false. მიღებული შედეგი უნდა დაბეჭდოთ

function test2(num1) {
    return num1 > 10
}
console.log(test2(20))