/* დავალება 1 — სრულწლოვნება
ცვლადში age მოცემულია მომხმარებლის ასაკი.

დაწერე პროგრამა, რომელიც:

თუ ასაკი 18 ან მეტია, დაბეჭდავს "სრულწლოვანი ხარ".
წინააღმდეგ შემთხვევაში დაბეჭდავს "არასრულწლოვანი ხარ".*/
let age = 18
if (age >= 18) {
    console.log("You are adult")
}else {
    console.log("You are child")
}

/*დავალება 2 — ლუწი თუ კენტი
ცვლადში number მოცემულია მთელი რიცხვი.

დაწერე პროგრამა, რომელიც შეამოწმებს:

თუ რიცხვი ლუწია, დაბეჭდავს "ლუწი".
თუ რიცხვი კენტია, დაბეჭდავს "კენტი".*/

let number = 7
if (number % 2 == 0) {
    console.log("Number is Even")
}else {
    console.log("Number is Odd")
}

/*დავალება 3 — ქულის შეფასება
ცვლადში score მოცემულია ქულა (0-100).

დაწერე პროგრამა, რომელიც დაბეჭდავს:

"A" თუ ქულა არის 90-100;
"B" თუ ქულა არის 80-89;
"C" თუ ქულა არის 70-79;
"D" თუ ქულა არის 60-69;
"F" თუ ქულა 60-ზე ნაკლებია.*/

let score = 77 
if (score >= 90 && score <= 100) {
    console.log("A")
}else if (score >= 80 && score <= 89) {
    console.log("B")
}else if (score >= 70 && score <= 79) {
    console.log("C")
}else if (score >= 60 && score <= 69) {
    console.log("D")
}else {
    console.log("F")
}



/*დავალება 4 — ფასდაკლება
ცვლადში purchaseAmount მოცემულია შენაძენის თანხა.

თუ თანხა 100 ლარზე მეტია:

მომხმარებელი იღებს 10%-იან ფასდაკლებას.

სხვა შემთხვევაში:

ფასდაკლება არ ვრცელდება.

დაბეჭდე საბოლოო გადასახდელი თანხა.

(შეასრულეთ ეს ტერნარი ოპერატორით)
*/
let purchaseAmount = 110
purchaseAmount > 100 ? console.log(purchaseAmount * 0.9) : console.log(purchaseAmount)

/*
დავალება 5 — უდიდესი რიცხვის პოვნა (Ternary Operator)
მოცემულია ორი ცვლადი: a და b.

გამოიყენე ternary operator (? :), რათა განსაზღვრო, რომელი რიცხვია უფრო დიდი და შედეგი შეინახო ცვლადში max.

პირობა: ამ ამოცანაში if/else-ის გამოყენება არ შეიძლება. მხოლოდ ternary operator გამოიყენე.*/
let a = 15
b = 11 
max = a > b ? a : b
console.log(max)